"""
编码的过程：
变量->语句->函数->类

算术运算符：
    +
        1.求和
        2。正号
        3.连接两个字符串
    -
        1.求差
        2.负号
    *
        1.求乘积
        2.重复（打印语句中可以重复，python语言特有的）
    /
    //  取整除
    %  取余
    **  幂 a**b  求a的b次方（python特有的）

"""
# -----  +号的用途  -------
a = 10
b = +20
print(a+b)

# -----  -号的用途   -----
c = -20
print(a+c)
print(a-c)
# ---- *的用途 -----
d = 5
f = 6
m = d*f
print("m%d" % m)
# 打印重复的语句
print("hello"*10)
# -----求商-----
# 2.5
print(5/2)
# 2 取整除
print(5//2)
# 2.0
print(5//2.0)
# -----% 取余----
print(5 % 2)
print(10 % 4)

# ----- ** 幂-------
# 8
print(2 ** 3)
print(8 ** -2)




